In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
Train= pd.read_csv('Train.csv')
Train.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.750,NaN,Q,NaN,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.000,NaN,S,NaN,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.000,NaN,S,9,NaN,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.525,NaN,S,C D,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.250,NaN,Q,16,NaN,NaN

In [33]:
Test= pd.read_csv('Test.csv')
Test.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,"Flynn, Mr. John Irwin (""Irving"")",male,36.0,0.0,0.0,PC 17474,26.3875,E25,S,5,NaN,"Brooklyn, NY"
1,3.0,"Sage, Miss. Constance Gladys",female,NaN,8.0,2.0,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
2,1.0,"Rood, Mr. Hugh Roscoe",male,NaN,0.0,0.0,113767,50.0000,A32,S,NaN,NaN,"Seattle, WA"
3,2.0,"Gillespie, Mr. William Henry",male,34.0,0.0,0.0,12233,13.0000,NaN,S,NaN,NaN,"Vancouver, BC"
4,2.0,"Collander, Mr. Erik Gustaf",male,28.0,0.0,0.0,248740,13.0000,NaN,S,NaN,NaN,"Helsinki, Finland Ashtabula, Ohio"

In [3]:
Train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1009 non-null   float64
 1   survived   1009 non-null   float64
 2   name       1009 non-null   object
 3   sex        1009 non-null   object
 4   age        812 non-null    float64
 5   sibsp      1009 non-null   float64
 6   parch      1009 non-null   float64
 7   ticket     1009 non-null   object
 8   fare       1008 non-null   float64
 9   cabin      229 non-null    object
 10  embarked   1008 non-null   object
 11  boat       374 non-null    object
 12  body       98 non-null     float64
 13  home.dest  582 non-null    object
dtypes: float64(7), object(7)
memory usage: 110.5+ KB

In [5]:
Train.drop(['name','ticket','fare','cabin','embarked','boat','body','home.dest'], axis=1,inplace=True)
Train.head()

   pclass  survived     sex   age  sibsp  parch
0     3.0       0.0  female   NaN    0.0    0.0
1     2.0       0.0    male  39.0    0.0    0.0
2     2.0       1.0  female  40.0    0.0    0.0
3     3.0       1.0  female  31.0    1.0    1.0
4     3.0       1.0  female   NaN    2.0    0.0

In [7]:
from sklearn.preprocessing import LabelEncoder

In [8]:
le= LabelEncoder()

In [9]:
Train['sex']=le.fit_transform(Train['sex'])

In [10]:
Train.head()

   pclass  survived  sex   age  sibsp  parch
0     3.0       0.0    0   NaN    0.0    0.0
1     2.0       0.0    1  39.0    0.0    0.0
2     2.0       1.0    0  40.0    0.0    0.0
3     3.0       1.0    0  31.0    1.0    1.0
4     3.0       1.0    0   NaN    2.0    0.0

In [11]:
Train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   int32
 3   age       812 non-null    float64
 4   sibsp     1009 non-null   float64
 5   parch     1009 non-null   float64
dtypes: float64(5), int32(1)
memory usage: 43.5 KB

In [19]:
Train['age'].fillna(Train['age'].mean(), inplace=True)
Train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   int32
 3   age       1009 non-null   float64
 4   sibsp     1009 non-null   float64
 5   parch     1009 non-null   float64
dtypes: float64(5), int32(1)
memory usage: 43.5 KB

In [20]:
Train.head(10)

   pclass  survived  sex        age  sibsp  parch
0     3.0       0.0    0  29.838978    0.0    0.0
1     2.0       0.0    1  39.000000    0.0    0.0
2     2.0       1.0    0  40.000000    0.0    0.0
3     3.0       1.0    0  31.000000    1.0    1.0
4     3.0       1.0    0  29.838978    2.0    0.0
5     2.0       0.0    1  16.000000    0.0    0.0
6     2.0       0.0    1  43.000000    0.0    1.0
7     1.0       1.0    0  49.000000    0.0    0.0
8     1.0       0.0    1  48.000000    0.0    0.0
9     2.0       0.0    1  29.838978    0.0    0.0

In [27]:
columns=['pclass', 'sex','age','sibsp','parch']
X=Train[columns]
Y= Train['survived'].values

In [34]:
Test.drop(['name','ticket','fare','cabin','embarked','boat','body','home.dest'], axis=1,inplace=True)
Test.head()

   pclass     sex   age  sibsp  parch
0     1.0    male  36.0    0.0    0.0
1     3.0  female   NaN    8.0    2.0
2     1.0    male   NaN    0.0    0.0
3     2.0    male  34.0    0.0    0.0
4     2.0    male  28.0    0.0    0.0

In [36]:
from sklearn.preprocessing import LabelEncoder
le= LabelEncoder()
Test['sex']=le.fit_transform(Test['sex'])
Test.head()

   pclass  sex   age  sibsp  parch
0     1.0    1  36.0    0.0    0.0
1     3.0    0   NaN    8.0    2.0
2     1.0    1   NaN    0.0    0.0
3     2.0    1  34.0    0.0    0.0
4     2.0    1  28.0    0.0    0.0

In [37]:
Test['age'].fillna(Test['age'].mean(), inplace=True)
Test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  300 non-null    float64
 1   sex     300 non-null    int32
 2   age     300 non-null    float64
 3   sibsp   300 non-null    float64
 4   parch   300 non-null    float64
dtypes: float64(4), int32(1)
memory usage: 10.7 KB

# Decision Tree Classifier

In [29]:
from sklearn.tree import DecisionTreeClassifier

In [86]:
sk= DecisionTreeClassifier(criterion='entropy', max_depth=4)

In [87]:
sk.fit(X,Y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='entropy',
                       max_depth=4, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [88]:
Y_pred=sk.predict(Test)

In [89]:
Y_pred

array([0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0.,
       1., 1., 0., 1., 0., 0., 0., 0., 1., 1., 1., 1., 0., 0., 1., 0., 1.,
       0., 1., 0., 0., 0., 1., 1., 1., 0., 1., 0., 0., 1., 0., 0., 0., 0.,
       1., 0., 1., 0., 0., 0., 0., 1., 0., 1., 1., 1., 0., 0., 1., 0., 0.,
       0., 1., 1., 0., 0., 0., 1., 0., 1., 1., 0., 0., 1., 0., 0., 1., 1.,
       0., 0., 0., 0., 0., 1., 0., 0., 0., 1., 1., 0., 1., 1., 0., 1., 0.,
       0., 0., 0., 0., 1., 0., 1., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0.,
       1., 0., 1., 0., 0., 1., 0., 1., 0., 0., 1., 1., 1., 1., 0., 0., 0.,
       1., 1., 0., 1., 1., 0., 0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 1.,
       0., 0., 0., 0., 1., 0., 0., 0., 0., 1., 1., 0., 0., 0., 1., 1., 0.,
       1., 1., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 1., 0., 1., 0., 0.,
       0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 1., 1., 1., 0., 1., 1.,
       1., 1., 0., 0., 0., 0., 0., 0., 1., 1., 1., 0., 1., 0., 1., 1., 1.,
       0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 1., 0., 0., 1., 1., 1., 1., 1., 0., 1., 0., 0., 0., 1.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 1., 0., 0., 1., 0.,
       0., 0., 1., 0., 0., 0., 1., 0., 1., 0., 1., 0., 1., 0., 0., 1., 1.,
       0., 1., 0., 1., 0., 0., 1., 1., 0., 0., 1.])

In [99]:
df= pd.DataFrame(Y_pred)
df.columns=['survived']
df=df.astype(int)
df.head()

   survived
0         0
1         0
2         0
3         0
4         0

In [100]:
df.to_csv('Y_pred_DecisionTree.csv',index=True)

# Random Forest Classifier

In [92]:
from sklearn.ensemble import RandomForestClassifier

In [138]:
rf= RandomForestClassifier(n_estimators=10, criterion='entropy', max_depth=4)

In [139]:
rf.fit(X,Y)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='entropy', max_depth=4, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=10,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [140]:
rf.score(X,Y)

0.8087215064420218

In [141]:
Y_pred_RandomForest=rf.predict(Test)

In [142]:
df2= pd.DataFrame(Y_pred_RandomForest)
df2.columns=['survived']
df2.head()

   survived
0       0.0
1       0.0
2       0.0
3       0.0
4       0.0

In [146]:
df2=df2.astype(int)
df2.head()

   survived
0         0
1         0
2         0
3         0
4         0

In [145]:
df2.to_csv('Y_pred_RandomForest.csv',index=True)

The accuracy of both the models came out to be 82 and 83 percent respectively.